Revit 2026 API

# DocumentNewRoom(Phase) Method

---

Creates a new unplaced room and with an assigned phase.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Room NewRoom(
	Phase phase
)
```
```vb
Public Function NewRoom (
	phase As Phase
) As Room
```
```cpp
public:
Room^ NewRoom(
	Phase^ phase
)
```
```fsharp
member NewRoom :
        phase : Phase -> Room
```

#### Parameters

phase Phase
     The phase in which the room is to exist.

#### Return Value

Room If successful the new room , otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the phase does not exist in the given document. |

#### Reference

Document Class

NewRoom Overload

Autodesk.Revit.Creation Namespace